rorke-time/experiment1-sriov-rorke-time/rorke75-memtier-50k.txt
Executing: memtier_benchmark -h 128.110.218.200 -p 11211 --ratio=1:10 --test-time=30 --rate-limiting=250 -t 8 -c 25 --key-pattern=P:P --key-maximum 1000000 -P memcache_text
8         Threads
25        Connections per thread
30        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         4545.62          ---          ---         1.19944         0.94300         5.18300         6.20700       305.78 
Gets        45449.50     17983.38     27466.12         1.13236         0.90300         5.02300         6.55900      2173.92 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      49995.12     17983.38     27466.12         1.13846         0.91100         5.02300         6.49500      2479.70 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.087        0.000
SET       0.391        5.000
SET       0.503       10.000
SET       0.583       15.000
SET       0.639       20.000
SET       0.695       25.000
SET       0.751       30.000
SET       0.791       35.000
SET       0.839       40.000
SET       0.887       45.000
SET       0.943       50.000
SET       0.967       52.500
SET       0.999       55.000
SET       1.031       57.500
SET       1.063       60.000
SET       1.103       62.500
SET       1.135       65.000
SET       1.183       67.500
SET       1.223       70.000
SET       1.271       72.500
SET       1.335       75.000
SET       1.359       76.250
SET       1.399       77.500
SET       1.431       78.750
SET       1.479       80.000
SET       1.519       81.250
SET       1.575       82.500
SET       1.623       83.750
SET       1.687       85.000
SET       1.759       86.250
SET       1.847       87.500
SET       1.895       88.125
SET       1.951       88.750
SET       1.999       89.375
SET       2.063       90.000
SET       2.143       90.625
SET       2.223       91.250
SET       2.319       91.875
SET       2.431       92.500
SET       2.559       93.125
SET       2.735       93.750
SET       2.831       94.062
SET       2.943       94.375
SET       3.071       94.688
SET       3.199       95.000
SET       3.343       95.312
SET       3.503       95.625
SET       3.679       95.938
SET       3.871       96.250
SET       4.047       96.562
SET       4.223       96.875
SET       4.287       97.031
SET       4.351       97.188
SET       4.447       97.344
SET       4.479       97.500
SET       4.575       97.656
SET       4.639       97.812
SET       4.671       97.969
SET       4.767       98.125
SET       4.799       98.281
SET       4.895       98.438
SET       4.927       98.516
SET       4.959       98.594
SET       4.991       98.672
SET       5.055       98.750
SET       5.087       98.828
SET       5.119       98.906
SET       5.183       98.984
SET       5.247       99.062
SET       5.279       99.141
SET       5.343       99.219
SET       5.375       99.258
SET       5.375       99.297
SET       5.439       99.336
SET       5.471       99.375
SET       5.503       99.414
SET       5.535       99.453
SET       5.567       99.492
SET       5.599       99.531
SET       5.663       99.570
SET       5.727       99.609
SET       5.759       99.629
SET       5.759       99.648
SET       5.791       99.668
SET       5.823       99.688
SET       5.855       99.707
SET       5.887       99.727
SET       5.887       99.746
SET       5.919       99.766
SET       5.983       99.785
SET       6.015       99.805
SET       6.015       99.814
SET       6.047       99.824
SET       6.079       99.834
SET       6.079       99.844
SET       6.111       99.854
SET       6.111       99.863
SET       6.143       99.873
SET       6.175       99.883
SET       6.175       99.893
SET       6.207       99.902
SET       6.207       99.907
SET       6.239       99.912
SET       6.271       99.917
SET       6.271       99.922
SET       6.303       99.927
SET       6.303       99.932
SET       6.335       99.937
SET       6.399       99.941
SET       6.431       99.946
SET       6.463       99.951
SET       6.463       99.954
SET       6.495       99.956
SET       6.495       99.958
SET       6.527       99.961
SET       6.527       99.963
SET       6.559       99.966
SET       6.559       99.968
SET       6.591       99.971
SET       6.623       99.973
SET       6.623       99.976
SET       6.655       99.977
SET       6.655       99.978
SET       6.655       99.979
SET       6.687       99.980
SET       6.719       99.982
SET       6.719       99.983
SET       6.719       99.984
SET       6.751       99.985
SET       6.751       99.987
SET       6.751       99.988
SET       6.783       99.988
SET       6.783       99.989
SET       6.783       99.990
SET       6.815       99.990
SET       6.847       99.991
SET       6.879       99.991
SET       6.879       99.992
SET       6.943       99.993
SET       6.943       99.993
SET       6.975       99.994
SET       7.007       99.994
SET       7.007       99.995
SET       7.007       99.995
SET       7.039       99.995
SET       7.039       99.995
SET       7.071       99.996
SET       7.071       99.996
SET       7.199       99.996
SET       7.199       99.997
SET       7.199       99.997
SET       7.199       99.997
[...]
SET       7.199       99.998
SET       7.199       99.998
SET       7.231       99.998
SET       7.231       99.998
SET       7.231       99.998
[...]
SET       7.295       99.999
SET       7.295      100.000
---
GET       0.055        0.000
GET       0.367        5.000
GET       0.471       10.000
GET       0.551       15.000
GET       0.615       20.000
GET       0.663       25.000
GET       0.719       30.000
GET       0.767       35.000
GET       0.807       40.000
GET       0.855       45.000
GET       0.903       50.000
GET       0.927       52.500
GET       0.959       55.000
GET       0.983       57.500
GET       1.015       60.000
GET       1.047       62.500
GET       1.087       65.000
GET       1.119       67.500
GET       1.159       70.000
GET       1.207       72.500
GET       1.255       75.000
GET       1.279       76.250
GET       1.303       77.500
GET       1.335       78.750
GET       1.367       80.000
GET       1.407       81.250
GET       1.447       82.500
GET       1.495       83.750
GET       1.543       85.000
GET       1.607       86.250
GET       1.679       87.500
GET       1.719       88.125
GET       1.759       88.750
GET       1.815       89.375
GET       1.871       90.000
GET       1.935       90.625
GET       2.007       91.250
GET       2.095       91.875
GET       2.191       92.500
GET       2.319       93.125
GET       2.479       93.750
GET       2.575       94.062
GET       2.671       94.375
GET       2.799       94.688
GET       2.943       95.000
GET       3.087       95.312
GET       3.263       95.625
GET       3.439       95.938
GET       3.631       96.250
GET       3.807       96.562
GET       3.983       96.875
GET       4.063       97.031
GET       4.159       97.188
GET       4.223       97.344
GET       4.287       97.500
GET       4.351       97.656
GET       4.415       97.812
GET       4.479       97.969
GET       4.543       98.125
GET       4.639       98.281
GET       4.703       98.438
GET       4.735       98.516
GET       4.767       98.594
GET       4.799       98.672
GET       4.863       98.750
GET       4.895       98.828
GET       4.959       98.906
GET       4.991       98.984
GET       5.055       99.062
GET       5.119       99.141
GET       5.183       99.219
GET       5.215       99.258
GET       5.247       99.297
GET       5.279       99.336
GET       5.311       99.375
GET       5.343       99.414
GET       5.407       99.453
GET       5.439       99.492
GET       5.503       99.531
GET       5.535       99.570
GET       5.599       99.609
GET       5.631       99.629
GET       5.663       99.648
GET       5.695       99.668
GET       5.759       99.688
GET       5.791       99.707
GET       5.823       99.727
GET       5.887       99.746
GET       5.919       99.766
GET       5.983       99.785
GET       6.047       99.805
GET       6.079       99.814
GET       6.111       99.824
GET       6.143       99.834
GET       6.207       99.844
GET       6.239       99.854
GET       6.303       99.863
GET       6.367       99.873
GET       6.399       99.883
GET       6.495       99.893
GET       6.591       99.902
GET       6.623       99.907
GET       6.655       99.912
GET       6.719       99.917
GET       6.783       99.922
GET       6.847       99.927
GET       6.943       99.932
GET       7.103       99.937
GET       7.295       99.941
GET       7.551       99.946
GET       7.871       99.951
GET       8.127       99.954
GET       8.319       99.956
GET       8.511       99.958
GET       8.703       99.961
GET       8.895       99.963
GET       9.151       99.966
GET       9.343       99.968
GET       9.471       99.971
GET       9.727       99.973
GET       9.919       99.976
GET      10.047       99.977
GET      10.111       99.978
GET      10.239       99.979
GET      10.367       99.980
GET      10.431       99.982
GET      10.559       99.983
GET      10.623       99.984
GET      10.751       99.985
GET      10.879       99.987
GET      10.943       99.988
GET      11.007       99.988
GET      11.071       99.989
GET      11.135       99.990
GET      11.199       99.990
GET      11.327       99.991
GET      11.391       99.991
GET      11.455       99.992
GET      11.519       99.993
GET      11.647       99.993
GET      11.711       99.994
GET      11.711       99.994
GET      11.839       99.995
GET      11.903       99.995
GET      11.903       99.995
GET      11.967       99.995
GET      12.031       99.996
GET      12.095       99.996
GET      12.159       99.996
GET      12.223       99.997
GET      12.415       99.997
GET      12.415       99.997
GET      12.415       99.997
GET      12.479       99.997
GET      12.543       99.998
GET      12.607       99.998
GET      12.671       99.998
GET      12.799       99.998
GET      12.991       99.998
GET      13.055       99.998
GET      13.823       99.998
GET      14.719       99.999
GET      14.847       99.999
GET      15.679       99.999
GET      15.871       99.999
GET      16.767       99.999
GET      16.767       99.999
GET      17.791       99.999
GET      17.791       99.999
GET      18.687       99.999
GET      18.687       99.999
GET      19.711       99.999
GET      19.711       99.999
GET      19.711       99.999
[...]
GET      20.735       99.999
GET      20.735       99.999
GET      20.735      100.000
GET      20.735      100.000
GET      21.759      100.000
GET      21.759      100.000
GET      21.759      100.000
[...]
GET      22.783      100.000
GET      22.783      100.000
GET      22.783      100.000
[...]
GET      23.807      100.000
GET      23.807      100.000
---
WAIT      0.000      100.000